tutorials/tutorials.DTLreactingFoam/premixedFlame/CH4air.phi1.0/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01325e5;  //1  atm

boundaryField
{
    inlet
    {
        type            waveTransmissive;
        phi             phi;
        psi             thermo:psi;
        gamma           1.4;
    }
    outlet
    {
        type            waveTransmissive;
        phi             phi;
        psi             thermo:psi;
        gamma           1.4;
    }

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
